export const HelloMessage = () => {
    return (
        <div className="m-6 pb-0">
            <h1>Програма Сортування Масивів</h1>
            <p className="mt-6">
                Цей застосунок дозволяє створювати, генерувати та сортувати
                послідовності чисел, вказуючи їх розмір, тип чисел
                (цілочисельні, дробові, знакосталість тощо), обирати метод
                сортування з чотирьох запропонованих, обирати кращий метод
                шляхом аналізу результатів (час сортування, складність алгоритму
                тощо).
            </p>
            <p className="mt-3">
                При автоматичній генерації необхідно вказати діапазон значень
                (від і до), розмір масиву, вказати напрям сортування (від
                більшого або меншого чи навпаки) та обрати тип сортування.
            </p>
            <p className="mt-3">
                При вводі масиву самостійно потрібно вводити кожне з чисел (до
                50000 штук), вказавши напрям сортування та можливій з типів.
            </p>
        </div>
    );
};
